# pyrian 스터디
* 시간 : 2016.06.22, 오후 6시 ~ 7시 30분
* 주제 : udemy 사이트 "learning-python-for-data-analysis-and-visualization" 강좌
  - 19장 : Selecting Entries
  - 20장 : Data Alignment

In [ ]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [19]:
dframe1 = DataFrame(np.arange(4).reshape((2, 2)), columns = list('AB'), index=['NYC', 'LA'])

In [20]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [21]:
dframe2 = DataFrame(np.arange(9).reshape((3, 3)), columns = list('ADC'), index=['NYC', 'SF', 'LA'])

In [22]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [23]:
dframe1 + dframe2

      A   B   C   D
LA    8 NaN NaN NaN
NYC   0 NaN NaN NaN
SF  NaN NaN NaN NaN

In [24]:
dframe1.add(dframe2, fill_value = 0)

     A   B  C  D
LA   8   3  8  7
NYC  0   1  2  1
SF   3 NaN  5  4

In [27]:
dframe2['A']

NYC    0
SF     3
LA     6
Name: A, dtype: int32